from classes.BPLA import BPLA
from math import pi
import numpy as np

# Головні моменти інерції МК
I = np.array([  # noqa
    0.034,
    0.045,
    0.097
])
m = 2.0  # маса БПЛА, кг
dt = 0.01  # часовий такт оновлення значень
J = 1.0  # момент інерції рухомої частини електричногодвигуна (кг∙м2)
J0 = 1.0  # Момент інерції рухомою частини ДВЗ
Kf = 1.0  # Коефіцієнт силової характеристики ЕД
Kf0 = 1.0  # Коефіцієнт силової характеристики ДВЗ
Km = 1.0  # Коефіцієнт моментної характеристики ЕД
Km0 = 1.0  # Коефіцієнт моментної характеристики ДВз
p = np.array([
    np.array([-2, 0, -2]),
    np.array([-2, 0, 2]),
    np.array([2, 0, 2]),
    np.array([2, 0, -2]),
    np.array([6, 0, 0]),

])  # радіус-вектори розташування ДВЗ та ЕД в ЗСК (м)

# Силя тяжіння
G = np.array([
    0.0,
    -9.81,
    0.0
])

# Вектор локальної похідної кінетичного моменту двигунів
dH1 = 0.0
dH2 = 0.0
dH3 = 0.0

# Экспериментально отримані коефіцієнти опору повітря
Ksx = 0.0
Ksy = 0.0
Ksz = 0.0

# Початкові умови

X0 = 0.0
Y0 = 20.0
Z0 = 0.0
Vx0 = 0.0
Vy0 = 0.0
Vz0 = 0.0

psi0 = 0.0
teta0 = 0.0
gamma0 = 0.0
Om1 = 0.0  # вектор кутової швидкості МК
Om2 = 0.0  # вектор кутової швидкості МК
Om3 = 0.0  # вектор кутової швидкості МК
eps0 = 21.0 * 2 * pi
eps1 = 10.0 * 2 * pi
eps2 = 10.0 * 2 * pi
eps3 = 10.0 * 2 * pi
eps4 = 10.0 * 2 * pi
eps5 = 17.0 * 2 * pi


def start_bpla():
    state = np.array([
        X0, Y0, Z0,
        Vx0, Vy0, Vz0,
        psi0, teta0, gamma0,
        Om1, Om2, Om3,
        eps0,
        eps1,
        eps2,
        eps3,
        eps4,
        eps5
    ])

    BPLA(
        I, m, dt, J, J0, Kf, Kf0, Km, Km0, p, G,
        np.array([dH1, dH2, dH3]),
        state
    )
