from classes.BPLA import BPLA
import numpy as np

time = 100

# Головні моменти інерції МК
I = np.array([  # noqa
    1.8,
    2.8,
    3.0
])
m = 18.0  # маса БПЛА, кг
dt = 0.01  # часовий такт оновлення значень
J = 0.00016  # момент інерції рухомої частини електричногодвигуна (кг∙м2)
J0 = 0.04  # Момент інерції рухомою частини ДВЗ
Kf = 0.0005  # Коефіцієнт силової характеристики ЕД
Kf0 = 0.01  # Коефіцієнт силової характеристики ДВЗ
Km = 0.0001  # Коефіцієнт моментної характеристики ЕД
Km0 = 0.0004  # Коефіцієнт моментної характеристики ДВз
p = np.array([
    np.array([0.0, 0.0, 0.0]),
    np.array([0.5, 0.0, -0.5]),
    np.array([0.5, 0.0, 0.5]),
    np.array([-0.5, 0.0, 0.5]),
    np.array([-0.5, 0.0, -0.5]),
    np.array([-1.5, 0.0, 0.0]),
])  # радіус-вектори розташування ДВЗ та ЕД в ЗСК (м)

# Силя тяжіння
G = np.array([
    0.0,
    -9.81,
    0.0
])

# Экспериментально отримані коефіцієнти опору повітря
Ks = np.array([
    0.1,
    0.1,
    0.1
])

# Потрібна висота та  потрібні  координати
H_ = 50
end_pos = np.array([
    1500,
    0,
    800
])

Vx_ = 10  # м/с значення  поперечної  швидкості
Vymax = 2  # м/с Максимально допустима  швидкість  вертикального  руху
Vz_ = 10  # м/с значення  поперечної  швидкості

c = np.array([Kf0, Kf, Kf, Kf, Kf, Kf])

# Початкові умови

pos = np.array([
    0.0,
    50.0,
    0.0
])
v = np.array([
    0.0,
    0.0,
    0.0
])

psi = 0.0
teta = 0.0
gamma = 0.0
Om = np.array([0.0, 0.0, 0.0])  # вектор кутової швидкості МК
eps = np.array([
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0
])

omega = np.array([
    20.67 * 2 * np.pi,
    10 * 2 * np.pi,
    10 * 2 * np.pi,
    10 * 2 * np.pi,
    10 * 2 * np.pi,
    16.5 * 2 * np.pi,
])


def start_bpla(t=None, state=None):

    if state is None:
        state = [
            pos, v,
            psi, teta, gamma,
            Om, omega, eps
        ]

    if t is None:
        t = time

    bpla = BPLA(
        t,
        I, m, dt, J, J0, Kf, Kf0,
        Km, Km0, p, G, Ks, H_, end_pos,
        Vx_, Vymax, Vz_, c,
        state
    )
    bpla.launch()

    return bpla.states
